# GetFailureDefinitionRegistry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..GetFailureDefinitionRegistry Method
ControlledApplication Class See Also
---
Returns the instance of FailureDefinitionRegistry.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
```

Visual Basic
---
```text
Public Shared Function GetFailureDefinitionRegistry As FailureDefinitionRegistry
```

Visual C++
---
```text
public:
static FailureDefinitionRegistry^ GetFailureDefinitionRegistry()
```

# ### Return Value
The instance of FailureDefinitionRegistry.
# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace